app/Controllers/Auth.php

SELECT *
FROM `sys_user`
WHERE `username` = 'admin'
 LIMIT 1
---
   public function prosesLogin()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->Muser->where('username', $username)->first();