app/Controllers/ReturBarang.php

SELECT `id`, `username`
FROM `sys_user`
WHERE `idrole` = 2
SELECT `mst_produk`.`id` as `idproduk`, `harga_beli`, `mst_kategori`.`nama` as `nama_kategori`, `nama_produk`
FROM `mst_produk`
JOIN `mst_kategori` ON `mst_kategori`.`id` = `mst_produk`.`idkategori`
SELECT *
FROM `mst_produk`
WHERE `stok` <= 10
---
    public function index()
    {
        if (!$this->session->get('username') || $this->session->get('idrole') != 1) {
            return redirect()->to('/');
        }
        $username = session()->get('username');
        $supplier = $this->Muser->table('sys_user')
        ->select('id, username')
        ->where('idrole', 2)
        ->get()
        ->getResultArray();
        $produks = $this->Mstock->table('mst_produk')
        ->select('mst_produk.id as idproduk, harga_beli, mst_kategori.nama as nama_kategori, nama_produk')
        ->join('mst_kategori','mst_kategori.id = mst_produk.idkategori')
        ->get()
        ->getResultArray();
        $data = [
            'title' => 'Inventory Kantin | Retur Barang',
            'nama' => $this->session->get('nama'),
            'idrole' => $this->session->get('idrole'),
            'suppliers' => $supplier,
            'produks' => $produks,
            'datanya' => $this->Morder->getReturByUser($username),
            'stokminim' =>  $this->Mstock->where('stok <=', 10)->findAll()

SELECT `trx_detailorder`.`id` as `iddetailorder`, `trx_detailorder`.`qty`, `trx_order`.`order_code`, `mst_produk`.`nama_produk`
FROM `trx_detailorder`
JOIN `trx_order` ON `trx_order`.`id` = `trx_detailorder`.`idorder`
JOIN `mst_produk` ON `mst_produk`.`id` = `trx_detailorder`.`idproduk`
WHERE `idorder` = '1'
---
    public function getOrderDetails($idorder)
    {
        $data = $this->Morderdetail
                    ->join('trx_order', 'trx_order.id = trx_detailorder.idorder')
                    ->join('mst_produk', 'mst_produk.id = trx_detailorder.idproduk')
                    ->select('trx_detailorder.id as iddetailorder, trx_detailorder.qty, trx_order.order_code, mst_produk.nama_produk')
                    ->where('idorder', $idorder)
                    ->findAll();