app/Controllers/ReturSupplier.php

SELECT `id`, `username`
FROM `sys_user`
WHERE `idrole` = 2
SELECT `mst_produk`.`id` as `idproduk`, `harga_beli`, `mst_kategori`.`nama` as `nama_kategori`, `nama_produk`
FROM `mst_produk`
JOIN `mst_kategori` ON `mst_kategori`.`id` = `mst_produk`.`idkategori`
SELECT *
FROM `mst_produk`
WHERE `stok` <= 10
---
    public function index()
    {
        if (!$this->session->get('username') || $this->session->get('idrole') != 2) {
            return redirect()->to('/');
        }
        $username = session()->get('username');
        $supplier = $this->Muser->table('sys_user')
        ->select('id, username')
        ->where('idrole', 2)
        ->get()
        ->getResultArray();
        $produks = $this->Mstock->table('mst_produk')
        ->select('mst_produk.id as idproduk, harga_beli, mst_kategori.nama as nama_kategori, nama_produk')
        ->join('mst_kategori','mst_kategori.id = mst_produk.idkategori')
        ->get()
        ->getResultArray();
        $data = [
            'title' => 'Inventory Kantin | Retur Barang',
            'nama' => $this->session->get('nama'),
            'idrole' => $this->session->get('idrole'),
            'suppliers' => $supplier,
            'produks' => $produks,
            'datanya' => $this->Morder->getReturByUser($username),
            'stokminim' =>  $this->Mstock->where('stok <=', 10)->findAll()

UPDATE `trx_retur` SET `status` = 'Sukses', `updated_at` = '2024-11-26 16:46:27'
WHERE `trx_retur`.`id` IN ('16')
---
    public function confirmRetur()
    {
        $idretur = $this->request->getPost('id');

        if ($this->Mretur->update($idretur, ['status' => 'Sukses'])) {