app/Models/OrderModel.php

    public function getReturByUser($username)
    {
        $builder = $this->db->table('trx_order');
        $builder->select('trx_order.*, mst_produk.nama_produk, trx_detailorder.idorder, trx_detailorder.idproduk, trx_detailorder.qty, sys_user.alamat, trx_order.created_at as tglorder, sys_user.username as supplier');
        $builder->join('trx_detailorder', 'trx_detailorder.idorder = trx_order.id');
        $builder->join('mst_produk', 'mst_produk.id = trx_detailorder.idproduk');
        $builder->join('sys_user', 'sys_user.id = trx_order.idsupplier');
        $builder->where('trx_order.pemesan', $username);
        $builder->where('trx_order.catatan', 'Barang Diterima');


        $builder->groupBy('trx_order.id');
        $query = $builder->get();
---
SELECT `trx_order`.*, `mst_produk`.`nama_produk`, `trx_detailorder`.`idorder`, `trx_detailorder`.`idproduk`, `trx_detailorder`.`qty`, `sys_user`.`alamat`, `trx_order`.`created_at` as `tglorder`, `sys_user`.`username` as `supplier`
FROM `trx_order`
JOIN `trx_detailorder` ON `trx_detailorder`.`idorder` = `trx_order`.`id`
JOIN `mst_produk` ON `mst_produk`.`id` = `trx_detailorder`.`idproduk`
JOIN `sys_user` ON `sys_user`.`id` = `trx_order`.`idsupplier`
WHERE `trx_order`.`pemesan` = 'supplier'
AND `trx_order`.`catatan` = 'Barang Diterima'
GROUP BY `trx_order`.`id`