app/Models/ReturModel.php

SELECT COUNT(*) AS `numrows`
FROM `trx_retur`
---
    public function count_filtered($search = null)
    {
        $query = $this->db->table($this->table);
        $this->_apply_filter($query, $search);
        return $query->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `trx_retur`
---
	public function count_all(){
	    $tbl_storage = $this->db->table($this->table);
	    return $tbl_storage->countAllResults();

SELECT `trx_retur`.*, `trx_order`.`order_code`, `trx_order`.`created_at`
FROM `trx_retur`
JOIN `trx_order` ON `trx_order`.`id` = `trx_retur`.`idorder`
JOIN `sys_user` ON `sys_user`.`id` = `trx_order`.`idsupplier`
WHERE `trx_order`.`idsupplier` = '4'
AND `trx_retur`.`status` IN ('Sukses','Sementara')
---
    public function getReturnsBySupplier($idsupplier)
    {
        $idsupplier = session()->get('id');
        return $this->select('trx_retur.*, trx_order.order_code, trx_order.created_at')
            ->join('trx_order', 'trx_order.id = trx_retur.idorder')
            ->join('sys_user', 'sys_user.id = trx_order.idsupplier')
            ->where('trx_order.idsupplier', $idsupplier)
            ->whereIn('trx_retur.status', ['Sukses', 'Sementara'])  // Fetch records where status is either 'Sukses' or 'Sementara'
            ->findAll();